summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxFlash_bf.h
/** \\brief  Length for Ifx_FLASH_MARP_Bits.RES2 */
#define IFX_FLASH_MARP_RES2_LEN (1)

/** \\brief  Mask for Ifx_FLASH_MARP_Bits.RES2 */
#define IFX_FLASH_MARP_RES2_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_MARP_Bits.RES2 */
#define IFX_FLASH_MARP_RES2_OFF (2)

/** \\brief  Length for Ifx_FLASH_MARP_Bits.RES3 */
#define IFX_FLASH_MARP_RES3_LEN (1)

/** \\brief  Mask for Ifx_FLASH_MARP_Bits.RES3 */
#define IFX_FLASH_MARP_RES3_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_MARP_Bits.RES3 */
#define IFX_FLASH_MARP_RES3_OFF (3)

/** \\brief  Length for Ifx_FLASH_MARP_Bits.SELP0 */
#define IFX_FLASH_MARP_SELP0_LEN (1)

/** \\brief  Mask for Ifx_FLASH_MARP_Bits.SELP0 */
#define IFX_FLASH_MARP_SELP0_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_MARP_Bits.SELP0 */
#define IFX_FLASH_MARP_SELP0_OFF (0)

/** \\brief  Length for Ifx_FLASH_MARP_Bits.SELP1 */
#define IFX_FLASH_MARP_SELP1_LEN (1)

/** \\brief  Mask for Ifx_FLASH_MARP_Bits.SELP1 */
#define IFX_FLASH_MARP_SELP1_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_MARP_Bits.SELP1 */
#define IFX_FLASH_MARP_SELP1_OFF (1)

/** \\brief  Length for Ifx_FLASH_MARP_Bits.TRAPDIS */
#define IFX_FLASH_MARP_TRAPDIS_LEN (1)

/** \\brief  Mask for Ifx_FLASH_MARP_Bits.TRAPDIS */
#define IFX_FLASH_MARP_TRAPDIS_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_MARP_Bits.TRAPDIS */
#define IFX_FLASH_MARP_TRAPDIS_OFF (15)

/** \\brief  Length for Ifx_FLASH_PROCOND_Bits.APREN */
#define IFX_FLASH_PROCOND_APREN_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCOND_Bits.APREN */
#define IFX_FLASH_PROCOND_APREN_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCOND_Bits.APREN */
#define IFX_FLASH_PROCOND_APREN_OFF (11)

/** \\brief  Length for Ifx_FLASH_PROCOND_Bits.CAP0EN */
#define IFX_FLASH_PROCOND_CAP0EN_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCOND_Bits.CAP0EN */
#define IFX_FLASH_PROCOND_CAP0EN_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCOND_Bits.CAP0EN */
#define IFX_FLASH_PROCOND_CAP0EN_OFF (12)

/** \\brief  Length for Ifx_FLASH_PROCOND_Bits.CAP1EN */
#define IFX_FLASH_PROCOND_CAP1EN_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCOND_Bits.CAP1EN */
#define IFX_FLASH_PROCOND_CAP1EN_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCOND_Bits.CAP1EN */
#define IFX_FLASH_PROCOND_CAP1EN_OFF (13)

/** \\brief  Length for Ifx_FLASH_PROCOND_Bits.CAP2EN */
#define IFX_FLASH_PROCOND_CAP2EN_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCOND_Bits.CAP2EN */
#define IFX_FLASH_PROCOND_CAP2EN_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCOND_Bits.CAP2EN */
#define IFX_FLASH_PROCOND_CAP2EN_OFF (14)

/** \\brief  Length for Ifx_FLASH_PROCOND_Bits.CAP3EN */
#define IFX_FLASH_PROCOND_CAP3EN_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCOND_Bits.CAP3EN */
#define IFX_FLASH_PROCOND_CAP3EN_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCOND_Bits.CAP3EN */
#define IFX_FLASH_PROCOND_CAP3EN_OFF (15)

/** \\brief  Length for Ifx_FLASH_PROCOND_Bits.L */
#define IFX_FLASH_PROCOND_L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCOND_Bits.L */
#define IFX_FLASH_PROCOND_L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCOND_Bits.L */
#define IFX_FLASH_PROCOND_L_OFF (0)

/** \\brief  Length for Ifx_FLASH_PROCOND_Bits.MODE */
#define IFX_FLASH_PROCOND_MODE_LEN (2)

/** \\brief  Mask for Ifx_FLASH_PROCOND_Bits.MODE */
#define IFX_FLASH_PROCOND_MODE_MSK (0x3)

/** \\brief  Offset for Ifx_FLASH_PROCOND_Bits.MODE */
#define IFX_FLASH_PROCOND_MODE_OFF (9)

/** \\brief  Length for Ifx_FLASH_PROCOND_Bits.NSAFECC */
#define IFX_FLASH_PROCOND_NSAFECC_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCOND_Bits.NSAFECC */
#define IFX_FLASH_PROCOND_NSAFECC_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCOND_Bits.NSAFECC */
#define IFX_FLASH_PROCOND_NSAFECC_OFF (1)

/** \\brief  Length for Ifx_FLASH_PROCOND_Bits.OSCCFG */
#define IFX_FLASH_PROCOND_OSCCFG_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCOND_Bits.OSCCFG */
#define IFX_FLASH_PROCOND_OSCCFG_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCOND_Bits.OSCCFG */
#define IFX_FLASH_PROCOND_OSCCFG_OFF (8)

/** \\brief  Length for Ifx_FLASH_PROCOND_Bits.RAMIN */
#define IFX_FLASH_PROCOND_RAMIN_LEN (2)

/** \\brief  Mask for Ifx_FLASH_PROCOND_Bits.RAMIN */
#define IFX_FLASH_PROCOND_RAMIN_MSK (0x3)

/** \\brief  Offset for Ifx_FLASH_PROCOND_Bits.RAMIN */
#define IFX_FLASH_PROCOND_RAMIN_OFF (2)

/** \\brief  Length for Ifx_FLASH_PROCOND_Bits.RAMINSEL */
#define IFX_FLASH_PROCOND_RAMINSEL_LEN (4)

/** \\brief  Mask for Ifx_FLASH_PROCOND_Bits.RAMINSEL */
#define IFX_FLASH_PROCOND_RAMINSEL_MSK (0xf)

/** \\brief  Offset for Ifx_FLASH_PROCOND_Bits.RAMINSEL */
#define IFX_FLASH_PROCOND_RAMINSEL_OFF (4)

/** \\brief  Length for Ifx_FLASH_PROCOND_Bits.RES29 */
#define IFX_FLASH_PROCOND_RES29_LEN (2)

/** \\brief  Mask for Ifx_FLASH_PROCOND_Bits.RES29 */
#define IFX_FLASH_PROCOND_RES29_MSK (0x3)

/** \\brief  Offset for Ifx_FLASH_PROCOND_Bits.RES29 */
#define IFX_FLASH_PROCOND_RES29_OFF (28)

/** \\brief  Length for Ifx_FLASH_PROCOND_Bits.RES30 */
#define IFX_FLASH_PROCOND_RES30_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCOND_Bits.RES30 */
#define IFX_FLASH_PROCOND_RES30_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCOND_Bits.RES30 */
#define IFX_FLASH_PROCOND_RES30_OFF (30)

/** \\brief  Length for Ifx_FLASH_PROCOND_Bits.RPRO */
#define IFX_FLASH_PROCOND_RPRO_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCOND_Bits.RPRO */
#define IFX_FLASH_PROCOND_RPRO_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCOND_Bits.RPRO */
#define IFX_FLASH_PROCOND_RPRO_OFF (31)

/** \\brief  Length for Ifx_FLASH_PROCOND_Bits.RSTCNT */
#define IFX_FLASH_PROCOND_RSTCNT_LEN (12)

/** \\brief  Mask for Ifx_FLASH_PROCOND_Bits.RSTCNT */
#define IFX_FLASH_PROCOND_RSTCNT_MSK (0xfff)

/** \\brief  Offset for Ifx_FLASH_PROCOND_Bits.RSTCNT */
#define IFX_FLASH_PROCOND_RSTCNT_OFF (16)

/** \\brief  Length for Ifx_FLASH_PROCONDBG_Bits.DBGIFLCK */
#define IFX_FLASH_PROCONDBG_DBGIFLCK_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONDBG_Bits.DBGIFLCK */
#define IFX_FLASH_PROCONDBG_DBGIFLCK_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONDBG_Bits.DBGIFLCK */
#define IFX_FLASH_PROCONDBG_DBGIFLCK_OFF (1)

/** \\brief  Length for Ifx_FLASH_PROCONDBG_Bits.EDM */
#define IFX_FLASH_PROCONDBG_EDM_LEN (2)

/** \\brief  Mask for Ifx_FLASH_PROCONDBG_Bits.EDM */
#define IFX_FLASH_PROCONDBG_EDM_MSK (0x3)

